Cases/Benchmarking/shippingBox_convection_2D_coarse/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        maxIter             30;

        smoother         GaussSeidel;

    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|h|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|h|R)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    turbOnFinalIterOnly true;
    consistent          true;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p_rgh   5e-4;
        U       4e-6;
        h       4e-4;
    }
    outerCorrectorResidualControl
    {
        //- Weak control - bad accuracy but faster
        p_rgh
        {
            relTol      0;
            tolerance   1e-3;
        }

        U
        {
            relTol      0;
            tolerance   1e-4;
        }

        h
        {
            relTol      0;
            tolerance   1e-4;
        }
    }
    // pRefPoint           (0.5 0.5 0.5);
    // pRefValue           10000;
}

relaxationFactors
{
    // fields
    // {
    //     p_rgh           0.8;
    //     p_rghFinal      1;
    // }
    equations
    {
        h               0.7;
        hFinal          1;

        U               0.7;
        UFinal          1;
    }
}

// ************************************************************************* //
